Amiya200/stm32_water_tank/Core/Src/model_handle.c
static uint16_t SYS_CRC16(const uint8_t *d, uint16_t l)
{
    uint16_t c = 0xFFFF;
    while (l--) c = (c>>1) ^ (*d++ + 0xA001);
    return c;
}

void ModelHandle_SaveSettingsToEEPROM(void)
{
    SystemEEPROMBlock b;
    b.sig   = SYS_SIG;
    b.gap   = sys.gap_time_s;
    b.retry = sys.retry_count;
    b.uv    = sys.uv_limit;
    b.ov    = sys.ov_limit;
    b.maxrun = sys.maxrun_min;
    b.over10  = (uint16_t)(sys.overload * 10.0f);
    b.under10 = (uint16_t)(sys.underload * 10.0f);

    b.crc = 0;
    uint8_t *p = (uint8_t*)&b;
    for(int i=0;i<sizeof(b)-1;i++) b.crc ^= p[i];

    EEPROM_WriteBuffer(EE_ADDR_SYS_BLOCK, (uint8_t*)&b, sizeof(b));
}




/***************************************************************
 * ================= EEPROM SETTINGS LOAD ======================
 ***************************************************************/
void ModelHandle_LoadSettingsFromEEPROM(void)
{
    SystemEEPROMBlock b;
    EEPROM_ReadBuffer(EE_ADDR_SYS_BLOCK, (uint8_t*)&b, sizeof(b));

    uint8_t crc = 0;
    uint8_t *p = (uint8_t*)&b;
    for(int i=0;i<sizeof(b)-1;i++) crc ^= p[i];

    if(b.sig != SYS_SIG || crc != b.crc) return;

    sys.gap_time_s  = b.gap;
    sys.retry_count = b.retry;
    sys.uv_limit    = b.uv;
    sys.ov_limit    = b.ov;
    sys.maxrun_min  = b.maxrun;
    sys.overload    = b.over10 / 10.0f;
    sys.underload   = b.under10 / 10.0f;
}



/***************************************************************
 * ================= MODE STATE SAVE ===========================
 ***************************************************************/
void ModelHandle_SaveModeState(void)
{
    modeState.manual_on          = manualActive;
    modeState.semi_on            = semiAutoActive;
    modeState.timer_on           = timerActive;
    modeState.countdown_on       = countdownActive;
    modeState.twist_on           = twistActive;
    modeState.auto_on            = autoActive;
    modeState.motor_on           = (motorStatus == 1);
    modeState.power_restore_mode = powerRestoreMode;

    EEPROM_WriteBuffer(0x0200, (uint8_t*)&modeState, sizeof(modeState));
}

/***************************************************************
 * ================= MODE STATE LOAD ===========================
 ***************************************************************/
void ModelHandle_LoadModeState(void)
{
    EEPROM_ReadBuffer(0x0200, (uint8_t*)&modeState, sizeof(modeState));

    powerRestoreMode = modeState.power_restore_mode;
    if (powerRestoreMode > 2) powerRestoreMode = 0;

    if (powerRestoreMode == 1) /* NO */
    {
        manualActive = semiAutoActive = countdownActive =
        twistActive  = timerActive = autoActive = false;
        return;
    }

    manualActive    = modeState.manual_on;
    semiAutoActive  = modeState.semi_on;
    timerActive     = modeState.timer_on;
    countdownActive = modeState.countdown_on;
    twistActive     = modeState.twist_on;
    autoActive      = modeState.auto_on;
}

/***************************************************************
 * ================= TIMER EEPROM SAVE (SAFE) =================
 ***************************************************************/
void ModelHandle_SaveTimerToEEPROM(void)
{
    TimerEEPROMBlock blk;
    memset(&blk, 0, sizeof(blk));

    blk.signature = TIMER_EE_SIGNATURE;
    blk.version   = TIMER_EE_VERSION;
    memcpy(blk.slots, timerSlots, sizeof(timerSlots));

    blk.crc = Timer_CRC16((uint8_t*)&blk,
                          sizeof(blk) - sizeof(uint16_t));

    EEPROM_WriteBuffer(EE_ADDR_TIMER_BLOCK,
                       (uint8_t*)&blk,
                       sizeof(blk));
}

/***************************************************************
 * ================= TIMER EEPROM LOAD (SAFE) =================
 ***************************************************************/
void ModelHandle_LoadTimerFromEEPROM(void)
{
    TimerEEPROMBlock blk;
    EEPROM_ReadBuffer(EE_ADDR_TIMER_BLOCK,(uint8_t*)&blk,sizeof(blk));

    if(blk.signature != TIMER_EE_SIGNATURE) return;

    uint16_t crc = Timer_CRC16((uint8_t*)&blk, sizeof(blk)-2);
    if(blk.crc != crc) return;     // <<< CRITICAL

    memcpy(timerSlots, blk.slots, sizeof(timerSlots));
}


void Timer_EEPROM_EnsureValid(void)
{
    TimerEEPROMBlock blk;
    EEPROM_ReadBuffer(EE_ADDR_TIMER_BLOCK,(uint8_t*)&blk,sizeof(blk));

    uint16_t crc = Timer_CRC16((uint8_t*)&blk,sizeof(blk)-2);

    if(blk.signature!=TIMER_EE_SIGNATURE || blk.crc!=crc)
    {
        memset(timerSlots,0,sizeof(timerSlots));
        ModelHandle_SaveTimerToEEPROM();
    }
}



/***************************************************************
 * ============== FORWARD DECLARATIONS (REQUIRED) ==============
 ***************************************************************/

/* TIMER helpers */
static bool     timer_any_active_slot(void);
static uint16_t get_active_timer_gap_minutes(void);
static uint8_t  get_today_mask(void);
static bool     slot_is_active_now(const TimerSlot *t);

/* Tank level */
static bool     isTankFull(void);

/* Mode helpers */
static inline bool isAnyModeActive(void);

/* FSM ticks */
static void     auto_tick(void);
static void     countdown_tick(void);
static void     twist_tick(void);
static void     twist_time_logic(void);
static void     protections_tick(void);
static void     leds_from_model(void);
/***************************************************************
 * ================= TANK FULL DETECTION ======================
 ***************************************************************/
static bool isTankFull(void)
{
    static uint32_t stableStart = 0;
    static bool lastState = false;

    bool allZero = true;

    /* ADC channels 1..5 = tank probes */
    for (int i = 1; i <= 5; i++)
    {
        if (adcData.voltages[i] > 0.10f)
        {
            allZero = false;
            break;
        }
    }

    uint32_t now = HAL_GetTick();

    if (allZero)
    {
        if (!lastState)
        {
            lastState = true;
            stableStart = now;
        }

        if ((now - stableStart) >= 1000)
            return true;
    }
    else
    {
        lastState = false;
    }

